from telethon import events
from config import client  # استيراد الكلاينت من ملف config

channel_username = "@zzio5"

books = {
    ".الامام علي من المهد الى اللحد": 661,
    ".فاطمة الزهراء من المهد الى اللحد": 662,
    ".زينب الكبرى من المهد الى اللحد": 663,
    ".الامام الحسين من المهد الى اللحد": 664,
    ".الامام الصادق من المهد الى اللحد": 665,
    ".الامام الجواد من المهد الى اللحد": 666,
    ".الامام الهادي من المهد الى اللحد": 667,
    ".الحسن العسكري من المهد الى اللحد": 668,
    ".المهدي من المهد الى الظهور": 669,
    ".البرهان في تفسير القران ج1": 670,
    ".البرهان في تفسير القران ج2": 671,
    ".البرهان في تفسير القران ج3": 672,
    ".البرهان في تفسير القران ج4": 673,
    ".البرهان في تفسير القران ج5": 674,
    ".البرهان في تفسير القران ج6": 675,
    ".البرهان في تفسير القران ج7": 676,
    ".البرهان في تفسير القران ج8": 677,
    ".التدبر في القران": 678,
    ".صحيح البخاري": 679,
    ".صحيح مسلم": 680  
}

library_message = """
⋆─┄─┄─┄─ الـمـكتــبـة ─┄─┄─┄─⋆

`.الامام علي من المهد الى اللحد`
`.فاطمة الزهراء من المهد الى اللحد`
`.زينب الكبرى من المهد الى اللحد`
`.الامام الحسين من المهد الى اللحد`
`.الامام الصادق من المهد الى اللحد`
`.الامام الجواد من المهد الى اللحد`
`.الامام الهادي من المهد الى اللحد`
`.الحسن العسكري من المهد الى اللحد`
`.المهدي من المهد الى الظهور`
`.البرهان في تفسير القران ج1`
`.البرهان في تفسير القران ج2`
`.البرهان في تفسير القران ج3`
`.البرهان في تفسير القران ج4`
`.البرهان في تفسير القران ج5`
`.البرهان في تفسير القران ج6`
`.البرهان في تفسير القران ج7`
`.البرهان في تفسير القران ج8`
`.التدبر في القران`
`.صحيح البخاري`
`.صحيح مسلم`
"""

library_image = "https://i.postimg.cc/438418Mt/3929a0fcb02ffd0642c740ef5cb088c1.jpg"

@client.on(events.NewMessage(pattern=r"\.(?:مكتبة|مكتبه)$"))
async def library_intro(event):
    me = await client.get_me()
    if event.sender_id != me.id:  # فقط الرسائل الصادرة منك
        return
    # حذف رسالة المستخدم
    await event.delete()
    # إرسال الكليشة مع الصورة
    await event.respond(message=library_message, file=library_image)

@client.on(events.NewMessage(pattern=r"\.(.+)$"))
async def send_book(event):
    me = await client.get_me()
    if event.sender_id != me.id:  # فقط الرسائل الصادرة منك
        return
    cmd = event.raw_text.strip()
    if cmd in books:
        msg_id = books[cmd]
        msg = await client.get_messages(channel_username, ids=msg_id)
        if msg:
            await event.respond(file=msg)
        else:
            await event.respond("الكتاب غير موجود.")