from telethon import events
from config import client

OWNER_ID = None

async def get_owner_id():
    global OWNER_ID
    if OWNER_ID is None:
        me = await client.get_me()
        OWNER_ID = me.id

@client.on(events.NewMessage(pattern=r"\.م24"))
async def m24_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ اوامــر التـشفـير   ─┄─┄─┄─⋆

 ⎉╎ `.تشفير` | بالرد على الرسالة 
✶ لتشفير الرسالة 

 ⎉╎ `.فك التشفير` | بالرد على الرسالة 
✶ لفك تشفير الرسالة

⎉╎ `.تشفير الملف + عدد الطبقات` | بالرد على الملف 
✶ لتشفير الملف بمارشال+ base64 

↢ مثال .تشفير الملف 10 شيشفر الملف بـ10 طبقات 

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)


@client.on(events.NewMessage(pattern=r"\.م25"))
async def m25_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ اوامــر الترحيب ─┄─┄─┄─⋆

⎉╎ `تعيين صورة الترحيب` | بالرد على الصورة 
✶  يقوم بأضافة صورة للترحيب

⎉╎ `.حذف صورة الترحيب` 
✶ يقوم بحذف صورة الترحيب المضافة سابقًا 

⎉╎ `.تعيين كليشة الترحيب` | بالرد 
✶ يقوم بتعيين كليشة للترحيب 

⎉╎`.حذف كليشة الترحيب` 
✶ يقوم بحذف كليشة الترحيب المضافة سابقًا 

⎉╎ `.تفعيل الترحيب`
✶ الامر + تعطيل او تفعيل لـ تفعيل الترحيب عند دخول شخص جديد في المجموعة يرسل حسابك ترحيب  

⎉╎`.الترحيب`
✶ لعرض معلومات الترحيب 
⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)


@client.on(events.NewMessage(pattern=r"\.م15"))
async def m15_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ اوامــر الـصيـد ─┄─┄─┄─⋆

✶ بدء الصيد:
   ↢  `.صيد + النمط` 
   ↢ لبدء عملية صيد اليوزرات حسب النمط المحدد.
   ↢ `.صيد_مستمر + النمط`
   ↢ لبدء عملية صيد متسمرة على النمط المحدد.   
   
✶ الانماط المدعومة:
   ↢ 1: حرف عشوائي من a إلى z
   ↢ 2: رقم عشوائي من 0 إلى 9
   ↢ 3: حرف او رقم عشوائي
   ↢ 4: حرف عشوائي من a إلى z مختلف
   ↢ 5: رقم عشوائي من 0 إلى 9 مختلف
   
✶ مثال توضيحي:
   ↢  `.صيد 12211` 
    الناتج المحتمل: s99ss

✶ ملاحظات إضافية:
   ↢ يمكنك إدراج [كلمة] او [_] ضمن النمط
 مثال:  .صيد _123_  ←النتيجة  _a9b_

✶ اوامر التحكم:
   ↢  `.ايقاف الصيد` 
   ↢ لإيقاف عملية الصيد الحالية

   ↢  `.حالة الصيد` 
   ↢ لعرض حالة الصيد الجارية (النمط، النتائج، الوقت...)

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)

@client.on(events.NewMessage(pattern=r"\.م16"))
async def m16_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ اوامــر القوائم  ─┄─┄─┄─⋆

 ⎉╎ `.قائمة قنواتي`

✶ قنواتك التي أنت فيها مالك أو مشرف

 ⎉╎ `.قائمة كروباتي`

✶ كروباتك التي أنت فيها مالك أو مشرف

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)

@client.on(events.NewMessage(pattern=r"\.م17"))
async def m17_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message ="""⋆─┄─┄─┄─ اوامــر الاختصارات ─┄─┄─┄─⋆

⎉╎ `.اختصار + كلمة` | بالرد
✶  يقوم بأضافة اختصار للكلمه

⎉╎ `.حذف اختصار` + الاختصار المضاف
✶ يقوم بحذف الاختصار المضاف

⎉╎ `.حذف اختصاراتي`
✶ يقوم بحذف كل الاختصارات

⎉╎ `.اختصاراتي`
✶ يعرض قائمة اختصاراتك

⎉╎ `.تشغيل الاختصارات`
✶ الامر تشغيل او ايقاف يقوم بايقاف او تشغيل الاختصارات

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)

@client.on(events.NewMessage(pattern=r"\.م18"))
async def m18_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ اوامــر المـنع  ─┄─┄─┄─⋆

⎉╎ `.منع كلمة + الكلمة`

✶ يمنع كتابة الكلمة داخل المجموعة

⎉╎ `.حذف كلمة المنع + الكلمة`

✶ يحذف الكلمة المضافة

⎉╎ `.قائمة الكلمات`

✶ يعرض قائمة الكلمات الممنوعة 

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)

@client.on(events.NewMessage(pattern=r"\.م19"))
async def m19_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ اوامــر الخطوط  ─┄─┄─┄─⋆

⎉╎ تحويل النصوص إلى أنماط خطوط مختلفة:

↢  `.خط غامق`   ↢ لكتابة النص بشكل غامق

↢  `.خط مشطوب`  ↢ لإظهار النص بخط مشطوب

↢  `.خط رمز`    ↢ لتحويل النص إلى رموز

↢  `.خط بايثون`   ↢ لإطلالة برمجية مميزة

↢  `.خط برنت`    ↢ شكل مطبوع أنيق

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)

@client.on(events.NewMessage(pattern=r"\.م20"))
async def m20_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ اوامــر اضـافـيـة  ─┄─┄─┄─⋆

↢  `.راتب`   ↢ يرسل راتبًا بالمجموعة تلقائيًا 

↢  `.بخشيش`  ↢ يرسل بخشيشًا بالمجموعة تلقائيًا 

↢  `.استثمار + العدد`    ↢ يقوم بإرسال استثمار + العدد تلقائيًا 

↢ `.استثمار فلوسي`  ↢ يقوم بإرسال  استثمار فلوسي تلقائيًا
( إذا كان البوت يدعم هذهِ الميزة )

↢  `.تعطيل + الأمر المستخدم`   ↢ يقوم بإيقاف التجميع

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)

@client.on(events.NewMessage(pattern=r"\.م21"))
async def m21_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ اوامــر سحب المحتوى  ─┄─┄─┄─⋆

⎉╎ `.سحب كامل المحتوى + يوزر القناة`

↢ يقوم بسحب كل محتوى القناة المحددة

⎉╎ `.سحب من الى + اليوزر + من رسالة الى رسالة` 

مثال ↢ `.سحب من الى @يوزرالقناة 5 - 6`

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)

@client.on(events.NewMessage(pattern=r"\.م22"))
async def m22_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ اوامــر ردود الخاص ─┄─┄─┄─⋆

⎉╎ `.تشغيل الرد`

↢ سيقوم بتشغيل الرد التلقائي 

⎉╎ `.تعطيل الرد`

↢ سيقوم بتعطيل الرد التلقائي

⎉╎ `.اوكف` 

↢ سيقوم بتعطيل الرد التلقائي في المحادثة

⎉╎ `.ارجع` 
↢ سيقوم بإعادة تشغيل الرد التلقائي في المحادثة

⎉╎ `.تعيين كليشة الرد` | بالرد

↢ يقوم بتعيين كليشة الرد

⎉╎ `.تعيين صورة الرد` | بالرد 

↢ يقوم بتعيين صورة الرد

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)

@client.on(events.NewMessage(pattern=r"\.م23"))
async def m23_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ اوامــر الوهــمـي ─┄─┄─┄─⋆

⎉╎ `.كتابة + عدد الثواني`

↢ يظهر أنك تكتب

⎉╎ `.فيد + عدد الثواني`

↢ يظهر أنك ترسل فيديو 

⎉╎ `.صوتية + عدد الثواني`

↢ يظهر أنك ترسل صوتية

⎉╎ `.ملف + عدد الثواني` 

↢ يظهر أنك ترسل ملفًا

⎉╎ `.موقع + عدد الثواني` 

↢ يظهر أنك ترسل موقعًا 

ملاحظــة:
    ↢ إذا لم تحدد الثواني يتم تعيين 15 ثانية تلقائيًا.

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)

@client.on(events.NewMessage(pattern=r"\.اوامر الميمز"))
async def m7_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ قائمة اوامر الميمز ─┄─┄─┄─⋆
• ︎البصمة : `.هزيمه مؤلمة`
• ︎البصمة : `.لعنه امون`
• ︎البصمة : `.ضحك 1`
• ︎البصمة : `.ضحك 2`
• ︎البصمة : `.خناجر` 
• ︎البصمة : `.زيج حزين`
• ︎البصمة : `.زيج`
• ︎البصمة : `.ام لولي`
• ︎البصمة : `.اشك هدومي`
• ︎البصمة : `.اغمضتها`
• ︎البصمة : `.خابرني عاليوتيوب`
• ︎البصمة : `.اكل خرا`
• البصمة : `.كزاب`
• البصمة : `.السيدي`
• البصمة : `.خيار بصل`
• البصمة : `.مو مطي`
• البصمة : `.انلاصت`
⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)

@client.on(events.NewMessage(pattern=r"\.م13"))
async def m13_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ اوامــر المـيمـز ─┄─┄─┄─⋆

⎉╎ `.ميمز` + رابط الميمز+ الكلمه
✶  يقوم بأضافة ميمز جديد 

⎉╎ `.ازالة` + كلمه
✶ يقوم بأزالة الكلمه المضافة

⎉╎ `.ازالة_البصمات`
✶ يقوم بحذف كل بصمات الميمز المضافة

⎉╎ `.قائمة الميمز`
✶ يعرض قائمة الميمز

⎉╎ `.اوامر الميمز`
✶ يعرض قائمة الميمز الجاهزة

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)

@client.on(events.NewMessage(pattern=r"\.م14"))
async def m14_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ اوامــر التخصيص ─┄─┄─┄─⋆

⎉╎`.تعيين صورة الفحص` | `.حذف صورة الفحص` 
✶ يستخدم بالرد على اي صورة او فيديو او متحركة وسيظهر بعد كتابة .فحص

⎉╎ `.تعيين كليشة الفحص`   | `.حذف كليشة الفحص` 
✶ يستخدم بالرد على اي رسالة نصية وسيظهر بعد كتابة .فحص

⎉╎`.تعيين كليشة الحماية`  | `.حذف كليشة الحماية` 
✶  يستخدم بالرد على اي رسالة نصية وسيظهر بعد تفعيل الحماية 
⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)

@client.on(events.NewMessage(pattern=r"\.م12"))
async def m12_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ المـغادرة والتـصفية ─┄─┄─┄─⋆

 ⎉╎`.مغادرة القنوات`
✶ لمغادرة جميع القنوات التي تمتلكها باستثناء القنوات التي انت مالكها او مشرف فيها 

 ⎉╎ `.مغادرة الكروبات`
✶ لمغادرة جميع المجموعات باستثناء المجموعات التي انت مالكها او مشرف فيها

⎉╎ `.تصفيه البوتات`
✶ يقوم بحذف وحظر كل البوتات بالحساب 

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)
from telethon import events

@client.on(events.NewMessage(pattern=r"\.م8"))
async def m8_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─  النشــر التلقــائي ─┄─┄─┄─⋆

 ⎉╎ `.نشر عدد الثواني معرف الكروب` :
✶ للنشر في المجموعة التي وضعت معرفها مع عدد الثواني

 ⎉╎ `.نشر_كروبات عدد الثواني` : 
✶ للنشر في جميع المجموعات الموجوده في حسابك
 
 ⎉╎ `.سوبر عدد الثواني` : 
✶ للنشر بكافة المجموعات السوبر التي منظم اليها 

 ⎉╎ `.تناوب عدد الثواني` : 
✶ للنشر في جميع المجموعات بالتناوب وحسب الوقت المحدد 

 ⎉╎`.خاص` : 
✶ للنشر في جميع المحادثات الخاصة مرة واحدة فقط

 ⎉╎ `.نقط عدد الثواني` : 
✶ للرد على نفس الرسالة ب (.) وحسب الوقت المحدد 

 ⎉╎ `.مكرر عدد الثواني` : 
✶ لتكرار نفس الرسالة وحسب الوقت المحدد 

 ⎉╎`.وسبام` :
✶ يرسل الجملة كلمة بعد كلمة

 ⎉╎ `.ايقاف النشر` :
✶ لأيقاف جميع انواع النشر اعلاه

• مُـلاحظة : جميع الأوامر اعلاه تستخدم بالرد على الرسالة او الكليشة المُراد نشرها

• مُـلاحظة : جميع الأوامر اعلاه تستقبل صورة واحدة موصوفة بنص وليس اكثر من ذلك

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)

@client.on(events.NewMessage(pattern=r"\.م26"))
async def m26_command(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    await get_owner_id()
    if event.sender_id != OWNER_ID:
        return
    message = """⋆─┄─┄─┄─ اوامــر الـقفـل ─┄─┄─┄─⋆

 ⎉╎`قفل الملصقات`
✶ الامر + قفل او فتح لـ قفل ارسـال الملصقات فـي المـحادثة التـي يتـم التفـعيل فيـها 

 ⎉╎ `.قفل الصور`
✶ الامر + قفل او فتح لـ قفل ارسـال الصـور فـي المـحادثة التـي يتـم التفـعيل فيـها

⎉╎ `.قفل الفيديو`
✶ الامر + قفل او فتح لـ قفل ارسـال الفيـديوهات فـي المـحادثة التـي يتـم التفـعيل فيـها

⎉╎ `.قفل الصوت`
✶ الامر + قفل او فتح لـ قفل ارسـال الاصـوات فـي المـحادثة التـي يتـم التفـعيل فيـها

⎉╎ `.قفل GIF`
✶ الامر + قفل او فتح لـ قفل ارسـال المتـحركه فـي المـحادثة التـي يتـم التفـعيل فيـها

⎉╎ `.قفل الملفات`
✶ الامر + قفل او فتح لـ قفل ارسـال المـلفات فـي المـحادثة التـي يتـم التفـعيل فيـها

⎉╎ `.قفل الروابط`
✶ الامر + قفل او فتح لـ قفل ارسـال الـروابط فـي المـحادثة التـي يتـم التفـعيل فيـها

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
    await event.edit(message)

from telethon import events
OWNER_ID = None
commands_main = """
⋆ـ┄──┄─ 𝐒𝐎𝐔𝐑𝐂𝐄 𝐙  ┄─┄─┄┄ـ⋆
• `.م1`  ➪  اوامــر الــيــوتــيــوب 
• `.م2`  ➪ اوامــر المجمــوعــه 
• `.م3`  ➪ اوامــر الـوقتــي
• `.م4`  ➪ اوامــر الخــاص
• `.م5`  ➪ اوامــر الــتــسـلـيــه
• `.م6`  ➪ اوامــر التـرفيـه
• `.م7`  ➪ اوامــر الـانتحـال و التـقليد
• `.م8`  ➪ اوامــر النشــر التلقــائي
• `.م9`  ➪ اوامــر الاشتــراك الاجبــاري
• `.م10` ➪ اوامــر الـذاتيــة و المـقيد
• `.م11` ➪ اوامــر الـتـخزين 
• `.م12` ➪ اوامــر المـغادرة والتـصفية
• `.م13` ➪ اوامــر المـيمـز 
• `.م14` ➪ اوامــر التخصيص و التعيين   
• `.م15` ➪ اوامــر صـيـد الـيـوزرات
• `.م16` ➪ اوامــر الـقـوائم
• `.م17` ➪ اوامــر الاختصارات
• `.م18` ➪ اوامــر الـمنع 
• `.م19` ➪ اوامــر الـخطوط
• `.م20` ➪ اوامــر اضـافـيـة
• `.م21` ➪ اوامــر سحب المحتوى 
• `.م22` ➪ اوامــر ردود الخاص 
• `.م23` ➪ اوامــر الوهــمـي
• `.م24` ➪ اوامــر التـشفـير
• `.م25` ➪ اوامــر التـرحيــب
• `.م26` ➪ اوامــر القـفل
⋆ـ┄──┄─ 𝐒𝐎𝐔𝐑𝐂𝐄 𝐙  ┄─┄─┄┄ـ⋆
"""

sections = {
".م1": """⋆─┄─┄─┄─ اوامــر الــيــوتــيــوب ─┄─┄─┄─⋆

⎉╎ `.يوت` + عنوان المقطع 

↢ للبحث عن أغنية أو مقطع في يوتيوب باستخدام جملة أو كلمة

⎉╎ `.تغيير اليوت + `@يوزر البوت 

↢ لتغيير بوت اليوتيوب في حال توقف عن العمل

⎉╎ `.حمل` + الرابط

↢ يقوم هذا الأمر بالتحميل من جميع المواقع

⎉╎ `.تغيير التحميل + `@يوزر البوت 

↢ لتغيير بوت التحميل في حال توقف عن العمل

⎉╎ `.تحميل` + رابط القصة

↢ يقوم هذا الأمر بتحميل ستوري تيليجرام

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆""",

".م2": """⋆─┄─┄─┄─  اوامــر المجمــوعــه ─┄─┄─┄─⋆

 ⎉╎ `.تقييد` | بالرد
✶ يقوم بتقيد الشخص من المجموعة

 ⎉╎ `.الغاء تقييد` | بالرد
✶ ︎يقوم بفك التقيد من الشخص 

  ⎉╎`.حظر`
✶ يقوم بحظر الشخص من المجموعة

  ⎉╎`.الغاء_الحظر`
✶ يقوم بفك حظر الشخص من المجموعة

 ⎉╎`.طرد`
✶ يقوم بطرد الشخص من المجموعة

 ⎉╎`.الغاء_الطرد`
✶ يقوم بألغاء طرد الشخص من المجموعة

 ⎉╎ `.كشف المجموعة`
✶ ︎ يعرض لك معلومات عن الكروب

 ⎉╎ `.تفعيل هنا`
✶ ︎قم برد في داخل الكروب لكي يتم تشغيل الردود في الكروب 

 ⎉╎ `.تعطيل هنا`
✶ ︎اذا قمت بل الارسال في داخل الكروب تفعيل هنا يمكنك تعطيلها اذا لم تفعل قلا تكتب شي 

 ⎉╎ `.اضف رد`
✶ ︎مثال اضف رد + السلام عليكم + وعليكم السلام عندما شخص يكتب السلام عليكم يرد بعليكم السلام

⎉╎ `.حذف رد`
✶ يحذف الرد المضاف مثال .حذف رد + السلام عليكم 

⎉╎ `.الردود`
✶ يعرض قائمة الردود المضافة

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆""",

".م3": """⋆─┄─┄─┄─ اوامــر الـوقتــي ─┄─┄─┄─⋆

✶  `.اسم_وقتي + البلد`
   ↢ لتفعيل ساعة جنب الاسم

✶  `.اشكال الوقت` 
   ↢ لعرض اشكال ارقام الساعة.

✶  `.ايقاف الاسم` 
   ↢ ليقوم بالايقاف

✶  `.ايقاف البايو` 
   ↢ يقوم بايقاف البايو

✶  `.الشكل مع رقم` 
   ↢ مثلا  .الشكل 4 

✶  `.بايو_وقتي + البلد`
   ↢ سيعرض الساعة في البايو
   ↢ او بايوهات انت تضعها

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆""",

".م4": """⋆─┄─┄─┄─ حمـايــة الخــاص ─┄─┄─┄─⋆

⎉╎ `.تفعيل الحماية`
✶ لـ تفعيـل حمايـة الخـاص لـ حسـابك

⎉╎ `.تعطيل الحماية`
✶ لـ تعطيـل حمايـة الخـاص لـ حسـابك

⎉╎ `.تحديد الانذارات`
✶ لـ تحـديد عدد التحذيرات في نظام الحمـاية

⎉╎ `.رفض`
✶ لـ رفـض الشخـص من ارسـال رسـائل الخـاص اثنـاء تفعيـل حمـاية الخـاص بحسـابك

⎉╎ `.سماح`
✶ لـ السمـاح لـ الشخـص بـ ارسـال رسـائل الخـاص اثنـاء تفعيـل حمـاية الخـاص بحسـابك بـدون تحـذير

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆""",

".م5": """⋆─┄─┄─┄─ اوامــر الــتـسلـيـه  ─┄─┄─┄─⋆

⎉╎ `.زواج` | بالرد

⎉╎ `.طلاك` | بالرد

⎉╎ `.نسبتنا` + اي كلمة

⎉╎`.︎بوسة` | بالرد

⎉╎ |.نسبة|  اي كلمة

⎉╎ `.فاك`

⎉╎ `.حب`

⎉╎ `.نام`

⎉╎`.اكس او`

⎉╎ `.مكتبة`
✶ لعرض مجموعة من الكتب 

⎉╎ `.زخرفة + الاسم`
✶ يقوم بزخرفة الاسم بـ15 نوع زخرفة 
 
 ↢  ملاحظة: امر .زخرفة يستقبل اسم بالغة الانكليزية فقط !

⎉╎ `.ايميل وهمي`
✶ يقوم بعمل ايميل وهمي (مؤقت)

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆""",

".م7": """⋆─┄─┄─┄─   الـانتحـال و التـقليد ─┄─┄─┄─⋆

 ⎉╎ `.انتحال` | بالرد على رسالة
✶ يقوم بانتحال الشخص

  ⎉╎ `.اعادة`
✶ يرجع حسابك لوضع الطبيعي 

  ⎉╎ `.تقليد` | بالرد
✶ يقوم بتقيد رسائل الشخص 

  ⎉╎ `.ايقاف التقليد`
✶ يقوم بإيقاف تقليد الشخص

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆""",

".م9": """⋆─┄─┄─┄─  الاشتــراك الاجبــاري ─┄─┄─┄─⋆

 ⎉╎ `.اضافة قناة` | مع يوزر القناة
✶ يجبر الشخص على الاشتراك بالقناة المحدده لمراسلتك في الخاص

  ⎉╎ `.حذف قناة` 
✶ يقوم هذا الامر بحذف القناة المضافة كأشتراك اجباري

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆""",

".م10": """⋆─┄─┄─┄─ الـذاتيــة و المـقيد ─┄─┄─┄─⋆

⎉╎ `.ذاتية` | بالرد
✶ يستخدم لحفظ الصور والفيديوهات المؤقتة .

⎉╎ `.حفظ الذاتية`
✶ سيقوم هذا الامر بعد تفعيلة بحفظ الصور والفيديوهات المؤقته تلقائيا .

⎉╎ `.مقيد` | مع رابط المنشور
✶  يقوم هذا الامر بحفظ المنشور من القنوات المقيدة

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆""",

".م6": """⋆─┄─┄─┄─  اوامــر التـرفيـه  ─┄─┄─┄─⋆

⎉╎ `.انطق`
 ✶  رمز اللغة مثلا ar بالرد على الجملة سيقوم بتحويلها صوت

⎉╎`.قرآن`
✶ يرسل صوت من القرآن بطريقة اخرى عشوائياً 

⎉╎`.قران`
✶ يرسل صوت من القران عشوائي

⎉╎ `.تفعيل القران`
✶ الامر + تعطيل او تفعيل لـ تفعيل القران عند ارسال شخص في المجموعة قران يرسل حسابك صوت قران عشوائي 

⎉╎ `.شعر`
✶ يقوم بأرسال صوت شعر عشوائي

⎉╎ `.تفعيل الشعر`
✶ الامر + تعطيل او تفعيل لـ تفعيل الشعر عند ارسال شخص في المجموعة شعر يرسل حسابك صوت شعر عشوائي

⎉╎ `.قصيدة`
✶ يرسل قصيدة عشوائية

⎉╎`.دعاء`
✶ يقوم بأرسال صوت شعر عشوائي

⎉╎ `.تفعيل الدعاء`
✶ الامر + تعطيل او تفعيل لـ تفعيل الدعاء عند ارسال شخص في المجموعة دعاء يرسل حسابك صوت دعاء عشوائي 

⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆""",

".م11": """⋆─┄─┄─┄─ اوامــر الـتـخـزين ─┄─┄─┄─⋆

⎉╎ `.تفعيل التخزين` 

↢ سيقوم بأنشاء كروب تخزين لتخزين الرسائل 

⎉╎ `.تعطيل التخزين`

↢ سيقوم هذا الامر بتعطيل التخزين


⋆─┄─┄─┄─ 𝑍 ─┄─┄─┄─⋆"""
}

@client.on(events.NewMessage(pattern=r'^\.الاوامر$'))
async def send_main_commands(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    global OWNER_ID
    if OWNER_ID is None:
        myself = await client.get_me()
        OWNER_ID = myself.id

    if event.sender_id != OWNER_ID:
        return

    await event.edit(commands_main)


@client.on(events.NewMessage(pattern=r'^.م(1[0-1]?|[1-9])$'))
async def send_section(event):
    me = await client.get_me()
    if event.sender_id != me.id:
        return
    global OWNER_ID
    if OWNER_ID is None:
        myself = await client.get_me()
        OWNER_ID = myself.id

    if event.sender_id != OWNER_ID:
        return

    key = event.raw_text.strip()  
    if key in sections:  
        await event.edit(sections[key])